
export interface Question {
  id: number;
  text: string;
}

export interface Factor {
  name: string;
  description: string;
  questionIds: number[];
}

export const questions: Question[] = [
  { id: 1, text: "当感觉特别沮丧或情绪不稳定时，会同时感到头部隐隐作痛吗？" },
  { id: 2, text: "在与他人的交流中，您是否容易因对方的言语或行为产生负面情绪？" },
  { id: 3, text: "您是否经常在脑海中反复排演即将到来的情景或对话？" },
  { id: 4, text: "在紧张或情绪波动剧烈时，是否会出现视线模糊或者头晕的现象？" },
  { id: 5, text: "您是否感觉到与亲密朋友或家人的互动比以前减少了？" },
  { id: 6, text: "当重要的计划因为他人的失误而被打乱时，您会感到特别焦虑或愤怒吗？" },
  { id: 7, text: "在与某人交谈后，您是否感觉自己不由自主地接受了他们的观点，即使之前并不同意？" },
  { id: 8, text: "当遇到突发事件时，您是否首先会考虑是谁的过失导致了问题？" },
  { id: 9, text: "您是否在看电影或电视剧后，很快忘记了剧情的主要发展？" },
  { id: 10, text: "在参加聚会或会议时，您是否总是不由自主地想整理自己的衣服或调整坐姿？" },
  { id: 11, text: "您在生活中很容易烦恼或情绪激动吗？" },
  { id: 12, text: "您会感到胸痛吗？" },
  { id: 13, text: "您会害怕空旷的场所或街道吗？" },
  { id: 14, text: "您感到自己身体精力在下降，行动变慢了吗？" },
  { id: 15, text: "您会有想要结束自己生命的念头吗？" },
  { id: 16, text: "您会听到别人听不到的声音吗？" },
  { id: 17, text: "您会出现身体不由自主发抖的情况吗？" },
  { id: 18, text: "您会觉得大多数人都是不可信任的吗？" },
  { id: 19, text: "您会觉得自己胃口不佳吗？" },
  { id: 20, text: "您是容易哭泣的人吗？" },
  { id: 21, text: "您和异性在一起时会感到害羞或不自在吗？" },
  { id: 22, text: "您会感觉被人欺骗或设计陷害您吗？" },
  { id: 23, text: "您会无故突然感到非常害怕吗？" },
  { id: 24, text: "您会突然大发脾气，难以自控吗？" },
  { id: 25, text: "您会害怕单独出门吗？" },
  { id: 26, text: "您会经常责怪自己吗？" },
  { id: 27, text: "您是否经常感到腰部酸痛或不适，即使休息后也没有明显缓解？" },
  { id: 28, text: "您觉得自己难以开展并完成各种任务吗？" },
  { id: 29, text: "您会感到孤独吗？" },
  { id: 30, text: "您经常感到苦闷吗？" },
  { id: 31, text: "您会过分担忧事情吗？" },
  { id: 32, text: "您会感到自己对一切都失去了兴趣吗？" },
  { id: 33, text: "当需要与人交谈时，您是否会突然感到紧张和语无伦次？" },
  { id: 34, text: "您觉得你的情感容易被伤害吗？" },
  { id: 35, text: "您会担心别人知道您的私人想法吗？" },
  { id: 36, text: "您会感到别人不理解、也不关心您吗？" },
  { id: 37, text: "您会感到别人对您不友好或不喜欢您吗？" },
  { id: 38, text: "您做事时必须进度很缓慢才能确保正确吗？" },
  { id: 39, text: "您会感到心跳非常厉害吗？" },
  { id: 40, text: "您会觉得恶心或胃部不舒服吗？" },
  { id: 41, text: "您会觉得自己比不上其他人吗？" },
  { id: 42, text: "当您情绪低落时，是否更容易感到身体的肌肉酸痛或僵硬？" },
  { id: 43, text: "您会感到自己被人监视或议论吗？" },
  { id: 44, text: "您是否就算感到疲惫也难以入睡？" },
  { id: 45, text: "您是否经常发现自己需要多次确认已完成的任务，例如查看是否锁好门或关掉电器？" },
  { id: 46, text: "在您需要作出决定时，是否感到很纠结？" },
  { id: 47, text: "您会害怕乘坐公共交通工具吗？" },
  { id: 48, text: "您会感到呼吸困难吗？" },
  { id: 49, text: "您的身体会突然感到发冷或发热吗？" },
  { id: 50, text: "您会因为内心的恐惧而选择回避某些事物、场所或活动吗？" },
  { id: 51, text: "您会感到头脑一片空白吗？" },
  { id: 52, text: "您的身体会出现发麻或刺痛的情况吗？" },
  { id: 53, text: "您的喉咙会感到压迫或呼吸困难吗？" },
  { id: 54, text: "您对未来持悲观和失望的态度吗？" },
  { id: 55, text: "您的注意力会很难集中吗？" },
  { id: 56, text: "您是否会感到身体的某些部位突然无力？" },
  { id: 57, text: "当乘坐飞机或高速电梯时，您是否会有失控的恐慌感？" },
  { id: 58, text: "您会感到手脚发重吗？" },
  { id: 59, text: "您会经常想到“死亡”相关的事吗？" },
  { id: 60, text: "您会经常暴食或饮食过量吗？" },
  { id: 61, text: "当别人注视或讨论您时，您会感到很有压力吗？" },
  { id: 62, text: "您是否会有一些奇特的想法，感觉不太像是您自己的？" },
  { id: 63, text: "您是否会有想伤害别人的冲动？" },
  { id: 64, text: "您是否会过早醒来，睡眠时间不足？" },
  { id: 65, text: "您会感到必须重复某些特定动作，如整理物品或按特定顺序摆放东西，以减轻焦虑吗？" },
  { id: 66, text: "您的睡眠质量通常很差吗？" },
  { id: 67, text: "您是否会有想破坏东西的冲动？" },
  { id: 68, text: "您是否经常反复怀疑自己的能力，担心做错事情？" },
  { id: 69, text: "您是否感到当着别人的面很难为情？" },
  { id: 70, text: "您是否会在像商场或电影院等人多的地方，感到不自在？" },
  { id: 71, text: "您会觉得处理任何事情都很困难吗？" },
  { id: 72, text: "当外出时，您是否会一直担心发生危险？" },
  { id: 73, text: "在公共场合吃东西，您会感到不舒服吗？" },
  { id: 74, text: "您是否经常与他人发生争论？" },
  { id: 75, text: "您一个人时会感到更紧张吗？" },
  { id: 76, text: "您会觉得别人没有对您的成就给予应有的肯定吗？" },
  { id: 77, text: "即使身边有人，您也会感到孤单吗？" },
  { id: 78, text: "您是否经常感到坐立不安和心神恍惚？" },
  { id: 79, text: "您会觉得自己一文不值吗？" },
  { id: 80, text: "您是否会感到一些熟悉的事物突然变得陌生起来？" },
  { id: 81, text: "您是否有突然大喊大叫或摔打物品的行为？" },
  { id: 82, text: "您会担心自己会在公共场所突然昏倒吗？" },
  { id: 83, text: "您会觉得别人想占您的便宜吗？" },
  { id: 84, text: "某些与“性”相关的想法，会让您感到苦恼吗？" },
  { id: 85, text: "您会因为自己的过错而有强烈的负罪感吗？" },
  { id: 86, text: "您在做事情时，是否有非常强烈的追求完美和效率的内在倾向？" },
  { id: 87, text: "您会担心自己身体有严重健康问题吗？" },
  { id: 88, text: "您是否很难与别人建立亲近的关系？" },
  { id: 89, text: "在日常生活中，您是否会因为认为自己做得不够好而感到深深的不安？" },
  { id: 90, text: "执行较复杂的工作时，您是否会感到注意力无法集中？" }
];

export const options = [
  { value: 1, label: "没有" },
  { value: 2, label: "很少" },
  { value: 3, label: "有时" },
  { value: 4, label: "经常" },
  { value: 5, label: "频繁" }
];

export const factors: Factor[] = [
  {
    name: "躯体化",
    description: "反映身体不适感，包括心血管、胃肠道、呼吸和其他系统的主诉不适，以及头痛、背痛、肌肉酸痛，以及焦虑的其他躯体表现。",
    questionIds: [1, 4, 12, 27, 40, 42, 48, 49, 52, 53, 56, 58]
  },
  {
    name: "强迫症状",
    description: "反映强迫症状。指那种明知没有必要，但又无法摆脱的无意义的思想、冲动和行为。",
    questionIds: [3, 9, 10, 28, 38, 45, 46, 51, 55, 65]
  },
  {
    name: "人际关系敏感",
    description: "主要反映个人的不自在感和自卑感，尤其是在与其他人相处时的人际交往方面。",
    questionIds: [6, 21, 34, 36, 37, 41, 61, 69, 73]
  },
  {
    name: "抑郁",
    description: "反映临床上抑郁症状群。以苦闷的情感与心境为代表性症状，以生活兴趣的减退、动力缺乏、活力丧失等为特征。",
    questionIds: [5, 14, 15, 20, 22, 26, 29, 30, 31, 32, 54, 71, 79]
  },
  {
    name: "焦虑",
    description: "指在临床上明显与焦虑症状相联系的精神症状及体验。一般指那些无法静息、神经过敏、紧张以及由此而产生的躯体征象。",
    questionIds: [2, 17, 23, 33, 39, 57, 72, 78, 80, 86]
  },
  {
    name: "敌对",
    description: "主要从三方面来反映敌对的表现：思想、感情及行为。包括厌烦的感觉，摔物，争论直到不可控制的脾气暴发等。",
    questionIds: [11, 24, 63, 67, 74, 81]
  },
  {
    name: "恐怖",
    description: "它与传统的恐怖状态或广场恐怖所反映的内容基本一致。恐惧的对象包括出门旅行，空旷场地，人群或公共场所和交通工具等。",
    questionIds: [13, 25, 47, 50, 70, 75, 82]
  },
  {
    name: "偏执",
    description: "主要指投射性思维，敌对，猜疑，关系妄想，被动体验和夸大等。",
    questionIds: [8, 18, 43, 68, 76, 83]
  },
  {
    name: "精神病性",
    description: "反映各式各样的精神病性症状，从温和的疏远、回避，到明显的精神病性症状。",
    questionIds: [7, 16, 35, 62, 77, 84, 85, 87, 88, 90]
  },
  {
    name: "其他",
    description: "主要反映睡眠及饮食情况。",
    questionIds: [19, 44, 59, 60, 64, 66, 89]
  }
];
